/**************************************************************************************************************


**************************************************************************************************************/
#define IC_TYPE_CA51F2X 0
#define IC_TYPE_CA51F3X 1

#define IRCH		0
#define IRCL		1
#define PLL			2
#define XOSCH		3
#define XOSCL		4

#define FW_VERSION    12

//蓝牙开关
#define EN_BLUETOOTH

//串口打印开关
//#define DEBUG


/**************************************************************************************************************/
#define IC_TYPE			IC_TYPE_CA51F2X     //芯片系列选择
#define SYSCLK_SRC	PLL									//芯片系统时钟选择,一般情况设置为IRCH或PLL
/**************************************************************************************************************/

/************系统时钟频率定义，主要用于配置UART波特率**********************************************************/
#if (SYSCLK_SRC == IRCH)
	#define FOSC		(3686400)
#elif (SYSCLK_SRC == PLL)
	#define PLL_Multiple			6			//定义PLL倍频倍数,当IRCH的频率为3.6864M时，最高倍频数不要超过6倍
	#define FOSC		(3686400*PLL_Multiple)
#else
	#define FOSC		(3686400)
#endif
/***************************************************************************************************************/

#define RTC_CLK_SELECT		IRCL			//定义RTC时钟源， 在外接32768晶振时定义为XOSCL，否则定义为IRCL
/***************************************************************************************************************/

#define LVD_RST_ENABLE	1	//芯片掉电到1.2V左右再重上电有可以导致死机，打开LVD复位功能可解决此问题


#define UART0_BAUTRATE		115200

/*********************************************************************************************************************/

/*********************************************/









